//------------------------------------------------------------------------------
// Bush.cpp - содержит методы прямоугольника
//------------------------------------------------------------------------------

#include "bush.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void Bush::In(ifstream& ifst) {
  ifst >> name >> type;
}

// Случайный ввод параметров прямоугольника
void Bush::InRnd() {
  name = Plant::rnd12.Get();
  type = Plant::rnd12.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Bush::Out(ofstream& ofst) {
  ofst << "It is Bush: name = " << name << ", type = " << type
    << ". Perimeter = " << Perimeter() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Bush::Perimeter() {
  return 2.0 * (x + y);
}
