//------------------------------------------------------------------------------
// Flower.cpp - содержит методы прямоугольника
//------------------------------------------------------------------------------

#include "flower.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void Flower::In(ifstream& ifst) {
  ifst >> name >> type;
}

// Случайный ввод параметров прямоугольника
void Flower::InRnd() {
  name = Plant::rnd12.Get();
  type = Plant::rnd12.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Flower::Out(ofstream& ofst) {
  ofst << "It is Rectangle: x = " << x << ", y = " << y
    << ". Perimeter = " << Perimeter() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Flower::Perimeter() {
  return 2.0 * (x + y);
}
