//------------------------------------------------------------------------------
// Bush.cpp - содержит методы прямоугольника
//------------------------------------------------------------------------------

#include "tree.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void Tree::In(ifstream& ifst) {
  ifst >> age >> name;
}

// Случайный ввод параметров прямоугольника
void Tree::InRnd() {
  name = Plant::rnd12.Get();
  age = Plant::rnd12.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Tree::Out(ofstream& ofst) {
  ofst << "It is Tree: name = " << name << ", age = " << age
    << ". Perimeter = " << Perimeter() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Tree::Perimeter() {
  return 2.0 * (x + y);
}
