//------------------------------------------------------------------------------
// Bush.cpp - содержит методы прямоугольника
//------------------------------------------------------------------------------

#include "flower.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void Bush::In(ifstream& ifst) {
  ifst >> x >> y;
}

// Случайный ввод параметров прямоугольника
void Bush::InRnd() {
  x = Plant::rnd20.Get();
  y = Plant::rnd20.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Bush::Out(ofstream& ofst) {
  ofst << "It is Bush: x = " << x << ", y = " << y
    << ". Perimeter = " << Perimeter() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Bush::Perimeter() {
  return 2.0 * (x + y);
}
